# Python 3.8.5
# Υπολογισμός κέρδους και ζημιάς με βάση τους τύπους των διαδοχικών ισολογισμών.
# Τύπος 1: Αποτέλεσμα = Τελικό Κεφάλαιο - Αρχικό Κεφάλαιο.
# Τύπος 2: Αποτέλεσμα = Τελικό Κεφάλαιο - Αρχικό Κεφάλαιο - Εισφορές Επιχειρηματία + Απολήψεις Επιχειρηματία.

eis = float(input("Δώστε τιμή εισφορών: "))
while eis < 0:
    print ("Η τιμή είναι αρνητική.")
    eis = float(input("Δώστε έγκυρη τιμή εισφορών: "))
apo = float(input("Δώστε τιμή απολήψεων: "))
while apo < 0:
    print ("Η τιμή είναι αρνητική.")
    apo = float(input("Δώστε έγκυρη τιμή απολήψεων: "))
arx = float(input("Δώστε τιμή αρχικού κεφαλαίου: "))
tel = float(input("Δώστε τιμή τελικού κεφαλαίου: "))
if eis == 0 and apo == 0:
    x = tel - arx
    if arx < 0 and tel < 0:
        print ("Οι τιμές των κεφαλαίων είναι αρνητικές."
"\n" + "Η τιμή του αρχικού κεφαλαίου στην επόμενη διαχειριστική χρήση θα είναι:", tel,
"\n" + "Το αποτέλεσμα είναι:", x)
    elif arx < 0:
        print ("Η τιμή του αρχικού κεφαλαίου είναι αρνητική."
"\n" + "Το αποτέλεσμα είναι:", x)
    elif tel < 0:
        print ("Η τιμή του τελικού κεφαλαίου είναι αρνητική."
"\n" + "Η τιμή του αρχικού κεφαλαίου στην επόμενη διαχειριστική χρήση θα είναι:", tel,
"\n" + "Το αποτέλεσμα είναι:", x)
    elif arx == 0 and tel == 0:
        print ("Οι τιμές των κεφαλαίων είναι:", x,
"\n" + "Το αποτέλεσμα είναι:", x)
    elif x > 0:
        print ("Το κέρδος είναι:", x)
    elif x < 0:
        print ("Η ζημιά είναι:", x)
    else:
        print ("Το κέρδος είναι:", x, "|", "Η ζημιά είναι:", x)
else:
    x = tel - arx - eis + apo
    if arx < 0 and tel < 0:
        print ("Οι τιμές των κεφαλαίων είναι αρνητικές."
"\n" + "Η τιμή του αρχικού κεφαλαίου στην επόμενη διαχειριστική χρήση θα είναι:", tel,
"\n" + "Το αποτέλεσμα είναι:", x)
    elif arx < 0:
        print ("Η τιμή του αρχικού κεφαλαίου είναι αρνητική."
"\n" + "Το αποτέλεσμα είναι:", x)
    elif tel < 0:
        print ("Η τιμή του τελικού κεφαλαίου είναι αρνητική."
"\n" + "Η τιμή του αρχικού κεφαλαίου στην επόμενη διαχειριστική χρήση θα είναι:", tel,
"\n" + "Το αποτέλεσμα είναι:", x)
    elif arx == 0 and tel == 0:
        print ("Οι τιμές των κεφαλαίων είναι:", x,
"\n" + "Το αποτέλεσμα είναι:", x)
    elif x > 0:
        print ("Το κέρδος είναι:", x)
    elif x < 0:
        print ("Η ζημιά είναι:", x)
    else:  
        print ("Το κέρδος είναι:", x, "|", "Η ζημιά είναι:", x)
