# Python 3.8.5
# Υπολογισμός κέρδους και ζημιάς με βάση τον τύπο των διαδοχικών ισολογισμών.
# Τύπος: Αποτέλεσμα = Τελικό Κεφάλαιο - Αρχικό Κεφάλαιο - Εισφορές Επιχειρηματία + Απολήψεις Επιχειρηματία.

eis = float(input("Δώστε ποσό εισφορών: "))
while eis < 0:
    print ("Ο αριθμός είναι αρνητικός.")
    eis = float(input("Δώστε έγκυρο ποσό εισφορών: "))
apo = float(input("Δώστε ποσό απολήψεων: "))
while apo < 0:
    print ("Ο αριθμός είναι αρνητικός.")
    apo = float(input("Δώστε έγκυρο ποσό απολήψεων: "))
arx = float(input("Δώστε ποσό αρχικού κεφαλαίου: "))
tel = float(input("Δώστε ποσό τελικού κεφαλαίου: "))
x = tel - arx - eis + apo
if arx < 0 or tel < 0:
    print ("Το αποτέλεσμα είναι:", x)
elif x > 0:
    print ("Το κέρδος είναι:", x)
elif x < 0:
    print ("Η ζημιά είναι:", x)
else:
    print ("Το κέρδος είναι:", x, "|", "Η ζημιά είναι:", x)
