# Python 3.8.5
# Υπολογισμός κέρδους και ζημιάς βάση των τύπων των διαδοχικών ισολογισμών:
# Τύπος 1: Αποτέλεσμα = Τελικό Κεφάλαιο - Αρχικό Κεφάλαιο.
# Τύπος 2: Αποτέλεσμα = Τελικό Κεφάλαιο - Αρχικό Κεφάλαιο - Εισφορές Επιχειρηματία + Απολήψεις Επιχειρηματία.

if eis == 0 and apo == 0:
    x = tel - arx
    if tel > arx:
        print ("Κέρδος:", x, "ευρώ")
    elif tel < arx:
        print ("Ζημιά:", x, "ευρώ")
    else:
        print ("Κέρδος:", x, "ευρώ", "\n" + "Ζημιά:", x, "ευρώ")
elif eis > 0 or apo > 0:
    x = tel - arx - eis + apo
    if x > 0:
        print ("Κέρδος:", x, "ευρώ")
    elif x < 0:
        print ("Ζημιά:", x, "ευρώ")
    else:
        print ("Κέρδος:", x, "ευρώ", "\n" + "Ζημιά:", x, "ευρώ")
